erl-ihe-rfd/erl-ihe-rfd/src/main/reference/Sample RFD RetrieveFormRequest Message.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
   <s:Header>
      <a:Action s:mustUnderstand="1">urn:ihe:iti:2007:RetrieveForm</a:Action>
      <a:MessageID>urn:uuid:bdf97132-1d69-4ead-a728-6d9f1ef23c53</a:MessageID>
      <a:ReplyTo>
         <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
      </a:ReplyTo>
      <a:To s:mustUnderstand="1">http://irfdformmanager.cloudapp.net/RFDFormManager.svc</a:To>
   </s:Header>
<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <RetrieveFormRequest xmlns="urn:ihe:iti:rfd:2007">
      <prepopData>
         <ClinicalDocument xmlns="urn:hl7-org:v3">
            <realmCode code="US"/>
            <typeId extension="POCD_HD000040" root="2.16.840.1.113883.1.3"/>
            <templateId extension="IMPL_CDAR2_LEVEL1" root="2.16.840.1.113883.10"/>
            <templateId root="1.2.840.114350.1.72.1.51693"/>
            <templateId root="2.16.840.1.113883.10.20.3"/>
            <templateId root="2.16.840.1.113883.10.20.1"/>
            <templateId root="2.16.840.1.113883.3.88.11.32.1"/>
            <templateId root="1.3.6.1.4.1.19376.1.5.3.1.1.5"/>
            <templateId root="1.3.6.1.4.1.19376.1.5.3.1.1.2"/>
            <templateId root="1.3.6.1.4.1.19376.1.5.3.1.1.1"/>
            <id assigningAuthorityName="EPC" extension="3386df08-9878-11e2-b544-0050568b309a" root="1.2.840.114350.6.13.356.1.7.1.1"/>
            <!-- Document Root that should be used for simulation purpouses, must be dif each time for XDR -->
            <code code="34133-9" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC" displayName="Summarization of Episode Note"/>
            <title>Continuity of Care Document</title>
            <effectiveTime value="20130329085440-0500"/>
            <confidentialityCode code="N" codeSystem="2.16.840.1.113883.5.25"/>
            <languageCode code="en-US"/>
            <setId assigningAuthorityName="EPC" extension="338820de-9878-11e2-b544-0050568b309a" root="1.2.840.114350.1.13.356.1.7.1.2"/>
            <versionNumber value="1"/>
            <recordTarget>
               <patientRole>
                  <id assigningAuthorityName="EPI" extension="116163" root="1.2.840.114350.1.6"/>
                  <!-- Patient Root Id that should be used for simulation purpouses, must be dif each time for XDR -->
                  <addr use="HP">
                     <streetAddressLine>1979 Milky Way</streetAddressLine>
                     <streetAddressLine>Apt 102</streetAddressLine>
                     <city>Verona</city>
                     <state>WI</state>
                     <postalCode>53593</postalCode>
                     <country>US</country>
                  </addr>
                  <telecom use="HP" value="tel:+1-123-456-7896"/>
                  <patient>
                     <name use="L">
                        <prefix qualifier="TITLE">Mr.</prefix>
                        <given>John</given>
                        <given>Michael</given>
                        <family>Doe</family>
                        <suffix>Jr.</suffix>
                     </name>
                     <administrativeGenderCode code="M" codeSystem="2.16.840.1.113883.5.1" codeSystemName="AdministrativeGenderCode" displayName="Male"/>
                     <birthTime value="20130324235613"/>
                     <maritalStatusCode code="T" codeSystem="2.16.840.1.113883.5.2" codeSystemName="MaritalStatusCode"/>
                     <raceCode code="BLACK/HISPAN" codeSystem="2.16.840.1.113883.6.238" codeSystemName="CDC Race and Ethnicity"/>
                     <ethnicGroupCode code="31" codeSystem="2.16.840.1.113883.6.238" codeSystemName="CDC Race and Ethnicity" displayName="Black-Hispanic Origin"/>
                     <guardian classCode="GUARD">
                        <templateId root="2.16.840.1.113883.3.88.11.32.3"/>
                        <templateId root="2.16.840.1.113883.3.88.11.83.3"/>
                        <templateId root="1.3.6.1.4.1.19376.1.5.3.1.2.4"/>
                        <id assigningAuthorityName="EPI" extension="116385" root="1.2.840.114350.1.1"/>
                        <code code="2.16.840.1.113883.5.111" codeSystem="2.16.840.1.113883.5.111" codeSystemName="RoleCode" displayName="Mother"/>
                        <addr>
                           <streetAddressLine>1979 Milky Way </streetAddressLine>
                           <streetAddressLine>Apt 102</streetAddressLine>
                           <city>Verona</city>
                           <state>WI</state>
                           <postalCode>53593</postalCode>
                           <country>US</country>
                           </addr>
                           <telecom use="HP" value="tel:+1-123-456-7896"/>
                           <guardianPerson>
                              <name>
                                 <family>Stamm</family>
                                 <given>Jeanne</given>
                                 <given>Lynn</given>
                              </name>
                           </guardianPerson>
                     </guardian>
                     <languageCommunication>
                         <languageCode code="en-US"/>
                         <preferenceInd value="true"/>
                     </languageCommunication>
                  </patient>
   <providerOrganization><name>General Central Hospital</name><addr use="HP"><streetAddressLine>W4447 MUSSER DRIVE</streetAddressLine><city>PHILLIPS</city><state>WI</state><postalCode>544555000</postalCode></addr></providerOrganization></patientRole></recordTarget><author><time value="20130329085440-0500"/><assignedAuthor><id nullFlavor="NA"/><addr nullFlavor="NA"/><telecom nullFlavor="NA"/><assignedPerson><name>Nurse McFee</name></assignedPerson><representedOrganization><id extension="1388803" root="1.2.840.114350.1.13.356.1.7.2.696570"/><name>Cirurgic Test Author</name><telecom nullFlavor="NA"/><addr nullFlavor="NA"/></representedOrganization></assignedAuthor></author><author><time value="20130329085440-0500"/><assignedAuthor><id extension="7.9" root="1.2.840.114350.1.1"/><addr nullFlavor="NA"/><telecom nullFlavor="NA"/><assignedAuthoringDevice><softwareName>Epic - Version 7.9</softwareName></assignedAuthoringDevice><representedOrganization><id extension="1388803" root="1.2.840.114350.1.13.356.1.7.2.696570"/><name>NLR Location</name><telecom nullFlavor="NA"/><addr nullFlavor="NA"/></representedOrganization></assignedAuthor></author><custodian><assignedCustodian><representedCustodianOrganization><id extension="1388803" root="1.2.840.114350.1.13.356.1.7.2.696570"/><name>NLR Location</name><telecom nullFlavor="NA"/><addr nullFlavor="NA"/></representedCustodianOrganization></assignedCustodian></custodian><documentationOf typeCode="DOC"><serviceEvent classCode="PCPR"><effectiveTime><low value="20130324"/><high value="20130329"/></effectiveTime><performer typeCode="PRF"><templateId root="2.16.840.1.113883.3.88.11.32.4"/><templateId root="2.16.840.1.113883.3.88.11.83.4"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.2.3"/><functionCode code="PP" codeSystem="2.16.840.1.113883.12.443" codeSystemName="Provider Role" displayName="Primary Care Provider"><originalText>Primary Care Provider</originalText></functionCode><time><low nullFlavor="NI"/><high nullFlavor="NI"/></time><assignedEntity nullFlavor="NI"><id nullFlavor="UNK"/><addr nullFlavor="NI"/><telecom nullFlavor="NI"/><representedOrganization><id extension="1388803" root="1.2.840.114350.1.13.356.1.7.2.696570"/><name>NLR Location</name><telecom nullFlavor="NA"/><addr nullFlavor="NA"/></representedOrganization></assignedEntity></performer></serviceEvent></documentationOf><component><structuredBody><component><section><templateId root="2.16.840.1.113883.10.20.1.2"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.3.13"/><templateId root="2.16.840.1.113883.3.88.11.83.102"/><id root="33976c06-9878-11e2-b544-0050568b309a"/><code code="48765-2" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC" displayName="Allergies, Adverse Reactions, Alerts"/><title>Allergies and Adverse Reactions</title><text><list><item><content>Not on File</content></item></list></text><entry><act classCode="ACT" moodCode="EVN"><templateId root="2.16.840.1.113883.10.20.1.27"/><templateId root="2.16.840.1.113883.3.88.11.32.6"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.4.5.1"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.4.5.3"/><templateId root="2.16.840.1.113883.3.88.11.83.6"/><id root="33977a48-9878-11e2-b544-0050568b309a"/><code nullFlavor="NA"/><statusCode code="active"/><effectiveTime><low nullFlavor="UNK"/></effectiveTime><entryRelationship inversionInd="false" typeCode="SUBJ"><observation classCode="OBS" moodCode="EVN" negationInd="false"><templateId root="2.16.840.1.113883.10.20.1.18"/><templateId root="2.16.840.1.113883.10.20.1.28"/><templateId root="2.16.840.1.113883.3.88.11.32.6"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.4.5"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.4.6"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1"/><id root="3397874a-9878-11e2-b544-0050568b309a"/><code code="416098002" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED CT" displayName="drug allergy"/><statusCode code="completed"/><effectiveTime><low nullFlavor="UNK"/></effectiveTime><value code="160244002" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED CT" displayName="No Known Allergies" xsi:type="CD"/></observation></entryRelationship></act></entry></section></component><component><section><templateId root="2.16.840.1.113883.10.20.1.11"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.3.6"/><templateId root="2.16.840.1.113883.3.88.11.83.103"/><id root="3397a0a4-9878-11e2-b544-0050568b309a"/><code code="11450-4" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC" displayName="PROBLEM LIST"/><title>Active Problems</title><text><list><item><content>Not on file</content></item></list></text><entry><act classCode="ACT" moodCode="EVN"><templateId root="2.16.840.1.113883.10.20.1.27"/><templateId root="2.16.840.1.113883.3.88.11.32.7"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.4.5.1"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.4.5.2"/><templateId root="2.16.840.1.113883.3.88.11.83.7"/><id root="3397ad92-9878-11e2-b544-0050568b309a"/><code nullFlavor="NA"/><statusCode code="active"/><effectiveTime><low nullFlavor="UNK"/></effectiveTime><entryRelationship inversionInd="false" typeCode="SUBJ"><observation classCode="OBS" moodCode="EVN" negationInd="false"><templateId root="2.16.840.1.113883.10.20.1.28"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.4.5"/><id root="3397b7c4-9878-11e2-b544-0050568b309a"/><code code="55607006" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED CT"/><text><reference value="#"/></text><statusCode code="completed"/><effectiveTime><low nullFlavor="UNK"/></effectiveTime><value code="396782006" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED CT" displayName="Past Medical History Unknown" xsi:type="CD"/></observation></entryRelationship></act></entry></section></component><component><section><templateId root="2.16.840.1.113883.10.20.1.14"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.3.27"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.3.28"/><templateId root="2.16.840.1.113883.3.88.11.83.122"/><id root="3398531e-9878-11e2-b544-0050568b309a"/><code code="30954-2" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC" displayName="STUDIES SUMMARY"/><title>Results</title><text><list><item><content>Not on file</content></item></list></text><entry><organizer classCode="BATTERY" moodCode="EVN"><templateId root="2.16.840.1.113883.10.20.1.32"/><id extension="260517"/><code code="261665006" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED CT" displayName="Unknown"/><statusCode code="completed"/><effectiveTime nullFlavor="UNK"/><component><observation classCode="OBS" moodCode="EVN"><templateId root="2.16.840.1.113883.10.20.1.31"/><templateId root="2.16.840.1.113883.3.88.11.83.15.1"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.4.13"/><id extension="260517.1"/><code code="261665006" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED CT" displayName="Unknown"/><text><reference nullFlavor="UNK"/></text><statusCode code="completed"/><effectiveTime nullFlavor="UNK"><low nullFlavor="UNK"/></effectiveTime><value xsi:type="CD" nullFlavor="NA"/><referenceRange><observationRange><text/></observationRange></referenceRange></observation></component><component><procedure classCode="PROC" moodCode="EVN"><templateId root="2.16.840.1.113883.10.20.1.29"/><templateId root="1.3.6.1.4.1.19376.1.5.3.1.4.19"/><templateId root="2.16.840.1.113883.3.88.11.83.17"/><id extension="260516"/><code nullFlavor="NA"><originalText><reference value="#" nullFlavor="UNK"/></originalText></code><text><reference nullFlavor="UNK"/></text><statusCode code="completed"/><effectiveTime nullFlavor="UNK"><low nullFlavor="UNK"/></effectiveTime></procedure></component></organizer></entry></section></component><component><section><templateId root="2.16.840.1.113883.10.20.1.3"/><code code="46240-8" codeSystem="2.16.840.1.113883.6.1" codeSystemName="LOINC" displayName="HISTORY OF ENCOUNTERS"/><title>Prior Encounters</title><text><table><colgroup><col width="10%"/><col width="15%"/><col width="13%"/><col width="25%"/><col width="37%"/></colgroup><thead><tr><th>Date</th><th>Type</th><th>Specialty</th><th>Providers</th><th>Description</th></tr></thead><tbody><tr ID="encounter1" styleCode="normRow"><td>3/27/13</td><td ID="type3">Hospital Encounter</td><td/><td/><td/></tr><tr ID="encounter2" styleCode="altRow"><td>3/27/13</td><td ID="type4">Registration</td><td/><td/><td/></tr></tbody></table></text></section></component></structuredBody></component></ClinicalDocument></prepopData><workflowData><formID>528d03c8c2825c2544dff4f3</formID><encodedResponse>false</encodedResponse><archiveURL>http://localhost/Oz.RFD.FormArchiver/AchiveForm_PortType.svc/soapService</archiveURL><context xsi:nil="true"/><instanceID xsi:nil="true"/></workflowData></RetrieveFormRequest></s:Body></s:Envelope>
